Connected to Python 3.12.9

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
df = pd.read_csv(
    "combinedNetflixData.txt",
    header=None,
    usecols=[0, 1],
    names=["CustID", "Ratings"],
)

In [ ]:
df

           CustID  Ratings
0              1:      NaN
1         1488844      3.0
2          822109      5.0
3          885013      4.0
4           30878      4.0
...           ...      ...
24058258  2591364      2.0
24058259  1791000      2.0
24058260   512536      5.0
24058261   988963      3.0
24058262  1704416      3.0

[24058263 rows x 2 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24058263 entries, 0 to 24058262
Data columns (total 2 columns):
 #   Column   Dtype
---  ------   -----
 0   CustID   object
 1   Ratings  float64
dtypes: float64(1), object(1)
memory usage: 367.1+ MB

In [ ]:
df[df["CustID"].str.contains(":")]

         CustID  Ratings
0            1:      NaN
548          2:      NaN
694          3:      NaN
2707         4:      NaN
2850         5:      NaN
...         ...      ...
24046714  4495:      NaN
24047329  4496:      NaN
24056849  4497:      NaN
24057564  4498:      NaN
24057834  4499:      NaN

[4499 rows x 2 columns]

In [ ]:
movie_count = df[df["CustID"].str.contains(":")].count()[0]

<ipython-input-6-ff705bad4f28>:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  movie_count = df[df["CustID"].str.contains(":")].count()[0]

In [ ]:
movie_count

4499

In [ ]:
cust_count = df["CustID"].nunique()
cust_count

475257

In [ ]:
cust_count = cust_count - movie_count
cust_count

470758

In [ ]:
ratings_count = len(df) - movie_count  # Total number of ratings in our given data
ratings_count

24053764

In [ ]:
movie_id = []
for x in df["CustID"]:
    if ":" in x:
        y = x.replace(":", "")
    movie_id.append(y)

In [ ]:
df["MovieID"] = movie_id
df

           CustID  Ratings MovieID
0              1:      NaN       1
1         1488844      3.0       1
2          822109      5.0       1
3          885013      4.0       1
4           30878      4.0       1
...           ...      ...     ...
24058258  2591364      2.0    4499
24058259  1791000      2.0    4499
24058260   512536      5.0    4499
24058261   988963      3.0    4499
24058262  1704416      3.0    4499

[24058263 rows x 3 columns]

In [ ]:
df.dropna(inplace=True)

In [ ]:
df

           CustID  Ratings MovieID
1         1488844      3.0       1
2          822109      5.0       1
3          885013      4.0       1
4           30878      4.0       1
5          823519      3.0       1
...           ...      ...     ...
24058258  2591364      2.0    4499
24058259  1791000      2.0    4499
24058260   512536      5.0    4499
24058261   988963      3.0    4499
24058262  1704416      3.0    4499

[24053764 rows x 3 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 24053764 entries, 1 to 24058262
Data columns (total 3 columns):
 #   Column   Dtype
---  ------   -----
 0   CustID   object
 1   Ratings  float64
 2   MovieID  object
dtypes: float64(1), object(2)
memory usage: 734.1+ MB

In [ ]:
df["CustID"] = df["CustID"].astype(int)
df["MovieID"] = df["MovieID"].astype(int)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 24053764 entries, 1 to 24058262
Data columns (total 3 columns):
 #   Column   Dtype
---  ------   -----
 0   CustID   int32
 1   Ratings  float64
 2   MovieID  int32
dtypes: float64(1), int32(2)
memory usage: 550.5 MB

In [ ]:
df.duplicated().sum()

0

In [ ]:
df["CustID"] = df["CustID"].astype(int)

In [ ]:
df["MovieID"] = df["MovieID"].astype(int)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 24053764 entries, 1 to 24058262
Data columns (total 3 columns):
 #   Column   Dtype
---  ------   -----
 0   CustID   int32
 1   Ratings  float64
 2   MovieID  int32
dtypes: float64(1), int32(2)
memory usage: 550.5 MB

In [ ]:
df.duplicated().sum()

0

In [ ]:
data_cust_summary = df.groupby("CustID")["Ratings"].count()
data_cust_summary

CustID
6          153
7          195
8           21
10          49
25           4
          ...
2649404     12
2649409     10
2649421      3
2649426     74
2649429     62
Name: Ratings, Length: 470758, dtype: int64

In [ ]:
cust_benchmark = round(data_cust_summary.quantile(0.60))
cust_benchmark

36

In [ ]:
data_cust_summary[data_cust_summary < cust_benchmark]  # Rejected Customer_ID

CustID
8          21
25          4
33         11
83         10
94         27
           ..
2649384     7
2649401    30
2649404    12
2649409    10
2649421     3
Name: Ratings, Length: 282042, dtype: int64

In [ ]:
Rejected_cust = data_cust_summary[data_cust_summary < cust_benchmark].index
Rejected_cust

Index([      8,      25,      33,      83,      94,     126,     130,     133,
           142,     149,
       ...
       2649337, 2649343, 2649351, 2649376, 2649379, 2649384, 2649401, 2649404,
       2649409, 2649421],
      dtype='int32', name='CustID', length=282042)

In [ ]:
df = df[~df["CustID"].isin(Rejected_cust)]  # Cleaning the data (Removing the less useful CustID)

In [ ]:
data_movie_summary = df.groupby("MovieID")["Ratings"].count()
data_movie_summary

MovieID
1        439
2         93
3       1699
4        108
5        869
        ...
4495     527
4496    8488
4497     631
4498     239
4499     363
Name: Ratings, Length: 4499, dtype: int64


Filter out customers with less than 60% of the average ratings

In [ ]:
data_movie_summary = df.groupby("MovieID")["Ratings"].count()
data_movie_summary

MovieID
1        439
2         93
3       1699
4        108
5        869
        ...
4495     527
4496    8488
4497     631
4498     239
4499     363
Name: Ratings, Length: 4499, dtype: int64

In [ ]:
movie_benchmark = round(data_movie_summary.quantile(0.60))
movie_benchmark

786

In [ ]:
Rejected_movies = data_movie_summary[data_movie_summary < movie_benchmark].index
Rejected_movies

Index([   1,    2,    4,    7,    9,   10,   11,   12,   13,   14,
       ...
       4480, 4481, 4486, 4487, 4491, 4494, 4495, 4497, 4498, 4499],
      dtype='int32', name='MovieID', length=2699)

In [ ]:
df = df[~df["MovieID"].isin(Rejected_movies)]
df

           CustID  Ratings  MovieID
696        712664      5.0        3
697       1331154      4.0        3
698       2632461      3.0        3
699         44937      5.0        3
700        656399      4.0        3
...           ...      ...      ...
24056842  1055714      5.0     4496
24056843  2643029      4.0     4496
24056844   267802      4.0     4496
24056845  1559566      3.0     4496
24056846   293198      3.0     4496

[19697529 rows x 3 columns]

In [ ]:
df_title = pd.read_csv(
    "NetflixMovieData.csv",
    header=None,
    usecols=[0, 1, 2],
    names=["MovieID", "Year", "Name"],
)

In [ ]:
df_title

       MovieID    Year                                               Name
0            1  2003.0                                    Dinosaur Planet
1            2  2004.0                         Isle of Man TT 2004 Review
2            3  1997.0                                          Character
3            4  1994.0                       Paula Abdul's Get Up & Dance
4            5  2004.0                           The Rise and Fall of ECW
...        ...     ...                                                ...
17764    17766  2002.0  Where the Wild Things Are and Other Maurice Se...
17765    17767  2004.0                  Fidel Castro: American Experience
17766    17768  2000.0                                              Epoch
17767    17769  2003.0                                        The Company
17768    17770  2003.0                                       Alien Hunter

[17769 rows x 3 columns]

In [ ]:
from surprise import Reader, Dataset, SVD
from surprise.model_selection import cross_validate

In [ ]:
reader = Reader()

In [ ]:
data = Dataset.load_from_df(df[["CustID", "MovieID", "Ratings"]][:1000000], reader)

In [ ]:
model = SVD()

In [ ]:
cross_validate(model, data, measures=["RMSE"], cv=3)

{'test_rmse': array([0.96910505, 0.96767568, 0.96882068]),
 'fit_time': (15.789720296859741, 12.228655099868774, 10.522419452667236),
 'test_time': (3.9303925037384033, 2.939146041870117, 2.435689926147461)}

In [ ]:
user_1331154 = df_title.copy()
user_1331154

       MovieID    Year                                               Name
0            1  2003.0                                    Dinosaur Planet
1            2  2004.0                         Isle of Man TT 2004 Review
2            3  1997.0                                          Character
3            4  1994.0                       Paula Abdul's Get Up & Dance
4            5  2004.0                           The Rise and Fall of ECW
...        ...     ...                                                ...
17764    17766  2002.0  Where the Wild Things Are and Other Maurice Se...
17765    17767  2004.0                  Fidel Castro: American Experience
17766    17768  2000.0                                              Epoch
17767    17769  2003.0                                        The Company
17768    17770  2003.0                                       Alien Hunter

[17769 rows x 3 columns]

In [ ]:
user_1331154 = df_title.copy()
user_1331154

       MovieID    Year                                               Name
0            1  2003.0                                    Dinosaur Planet
1            2  2004.0                         Isle of Man TT 2004 Review
2            3  1997.0                                          Character
3            4  1994.0                       Paula Abdul's Get Up & Dance
4            5  2004.0                           The Rise and Fall of ECW
...        ...     ...                                                ...
17764    17766  2002.0  Where the Wild Things Are and Other Maurice Se...
17765    17767  2004.0                  Fidel Castro: American Experience
17766    17768  2000.0                                              Epoch
17767    17769  2003.0                                        The Company
17768    17770  2003.0                                       Alien Hunter

[17769 rows x 3 columns]

In [ ]:
user_1331154["Estimate Score"] = user_1331154["MovieID"].apply(
    lambda x: model.predict(1331154, x).est)

In [ ]:
user_1331154["Estimate Score"] = user_1331154["MovieID"].apply(
    lambda x: model.predict(1331154, x).est)

In [ ]:
reader = Reader()

In [ ]:
data = Dataset.load_from_df(df[["CustID", "MovieID", "Ratings"]][:1000000], reader)

In [ ]:
model = SVD()

In [ ]:
cross_validate(model, data, measures=["RMSE"], cv=3)

{'test_rmse': array([0.96855215, 0.9687495 , 0.96853798]),
 'fit_time': (13.374587774276733, 13.625046730041504, 13.330703258514404),
 'test_time': (4.28935694694519, 3.30765700340271, 2.9661660194396973)}

In [ ]:
user_1331154 = df_title.copy()

In [ ]:
user_1331154

       MovieID    Year                                               Name
0            1  2003.0                                    Dinosaur Planet
1            2  2004.0                         Isle of Man TT 2004 Review
2            3  1997.0                                          Character
3            4  1994.0                       Paula Abdul's Get Up & Dance
4            5  2004.0                           The Rise and Fall of ECW
...        ...     ...                                                ...
17764    17766  2002.0  Where the Wild Things Are and Other Maurice Se...
17765    17767  2004.0                  Fidel Castro: American Experience
17766    17768  2000.0                                              Epoch
17767    17769  2003.0                                        The Company
17768    17770  2003.0                                       Alien Hunter

[17769 rows x 3 columns]

In [ ]:
user_1331154["Estimate Score"] = user_1331154["MovieID"].apply(
    lambda x: model.predict(1331154, x).est)

In [ ]:
user_1331154.sort_values(by="Estimate Score", ascending=False)

,MovieID,Year,Name,Estimate Score
269,270,2001.0,Sex and the City: Season 4,4.604835
241,242,1995.0,Neon Genesis Evangelion: The End of Evangelion,4.537224
75,76,1952.0,I Love Lucy: Season 2,4.301665
137,138,1995.0,Star Trek: Voyager: Season 1,4.189118
151,152,1995.0,A Little Princess,4.166995
...,...,...,...,...
15,16,1996.0,Screamers,2.805275
180,181,2004.0,The Last Shot,2.671931
46,47,1952.0,The Bad and the Beautiful,2.642455
224,225,2004.0,The Cookout,2.641458
25,26,2004.0,Never Die Alone,2.525364

In [ ]:
df["CustID"]

696          712664
697         1331154
698         2632461
699           44937
700          656399
             ...
24056842    1055714
24056843    2643029
24056844     267802
24056845    1559566
24056846     293198
Name: CustID, Length: 19697529, dtype: int32

In [ ]:
user_44937 = df_title.copy()

In [ ]:
user_44937

       MovieID    Year                                               Name
0            1  2003.0                                    Dinosaur Planet
1            2  2004.0                         Isle of Man TT 2004 Review
2            3  1997.0                                          Character
3            4  1994.0                       Paula Abdul's Get Up & Dance
4            5  2004.0                           The Rise and Fall of ECW
...        ...     ...                                                ...
17764    17766  2002.0  Where the Wild Things Are and Other Maurice Se...
17765    17767  2004.0                  Fidel Castro: American Experience
17766    17768  2000.0                                              Epoch
17767    17769  2003.0                                        The Company
17768    17770  2003.0                                       Alien Hunter

[17769 rows x 3 columns]

In [ ]:
user_44937["Estimate Score"] = user_44937["MovieID"].apply(
    lambda x: model.predict(44937, x).est)

In [ ]:
user_44937.sort_values(by="Estimate Score", ascending=False)

,MovieID,Year,Name,Estimate Score
75,76,1952.0,I Love Lucy: Season 2,4.524860
31,32,2004.0,ABC Primetime: Mel Gibson's The Passion of the...,4.468493
67,68,2004.0,Invader Zim,4.270591
240,241,1959.0,North by Northwest,4.251689
198,199,1978.0,The Deer Hunter,4.214202
...,...,...,...,...
76,77,1995.0,Congo,2.616534
187,188,2005.0,Dead Birds,2.611924
47,48,2001.0,Justice League,2.583528
224,225,2004.0,The Cookout,2.529069
126,127,1987.0,Fatal Beauty,2.451477